x = {
    'menu': (107, 9, 162, 36),  # 菜单
    'students-arrived': (581, 242, 700, 263),  # 学员到访

    '0.0': (1114, 642, 1155, 665),  # 咖啡厅收益0.0%
    'reward-text': (1100, 620, 1196, 640),  # 咖啡厅收益
    'get-reward': (606, 505, 670, 537),  # 领取咖啡厅收益

    'give-gift': (38, 556, 93, 587),

    'invite-status': (805, 588, 872, 604),  # 邀请状态

    'invitation-ticket': (421, 78, 451, 111),
    'inc-fav': (480, 596, 569, 636),  # 好感提升
    'inv-fav-level': (668, 141, 741, 162),  # 邀请-好感等級
    'inv-fav-sort': (828, 142, 839, 160),  # 邀请排序方式
    'inv-confirm': (738, 487, 799, 515),  # 确认邀请
}
