x = {
    'start-task': (107, 9, 162, 36),  # 任务开始界面
    'tasking': (7, 7, 67, 38),  # 任务中
    'edit-attack-force': (107, 9, 245, 36),  # 编辑攻击部队(jjc)
    'force-edit': (107, 9, 162, 36),  # 部队编辑界面
    'attack': (1126, 642, 1191, 670),  # 编队界面右下角出击
    'skip-fight': (1111, 531, 1136, 556),  # 跳过战斗
    'auto-over': (1072, 589, 1094, 611),  # 回合自动结束
    'fighting-task-info': (580, 78, 705, 115),  # 走格子过程中 任务信息
    'confirm': (732, 483, 800, 516),  # 移动部队/结束回合确认按钮

    'pass-confirm': (1144, 649, 1194, 674),  # 战斗成功第一次确认
    'task-finish-confirm': (1000, 648, 1063, 678),  # 战斗成功第二次确认(任务完成)
    'prize-confirm': (742, 642, 803, 668),  # 获得奖励确认按钮(支线通关)
}
