x = {
    'student': (322, 631, 343, 642),  # 首页学生
    'cafe': (88, 651, 96, 657),  # 咖啡厅
    'cafe-black': (88, 651, 96, 657),  # 咖啡厅(用来判断无法截图)
    'menu': (611, 248, 670, 278),  # 右上角点击菜单
    'bus': (107, 9, 162, 36),  # 业务区
    'home-feature': (1203, 24, 1240, 60),  # 右上角菜单(作为主页标志)
    'quick-home': (1215, 5, 1255, 42),  # 快速回到首页,左上
    'login-feature': (1105, 601, 1142, 640),  # 登录界面
    'news': (250, 85, 328, 117),  # 公告
    'store-error': (876, 152, 901, 174),  # 商店错误弹窗
    'news-intl': (55, 104, 83, 130)
}
