x = {
    'menu': (1178, 28, 1226, 51),
    'skip': (1195, 109, 1226, 128),
    'confirm-skip': (737, 509, 797, 534),
    'peach1': (144, 107, 169, 130),
    'peach2': (144, 107, 169, 130),
    'peach3': (144, 107, 169, 130),
    'peach4': (144, 107, 169, 130),

    'student': (231, 167, 275, 189),  # momo talk 学生
    'unread': (232, 167, 273, 189),  # momo talk 未读消息数量
    'sort-field': (493, 168, 527, 185),  # 排序方式 未读
    'sort-direction': (634, 169, 645, 186),  # 排序方式  倒序

    'reply': (786, 437, 832, 454),  # 回复
    'likable': (786, 533, 833, 551),  # 羁绊
    'begin-relationship': (828, 550, 887, 578)  # 开始好感故事
}
