x = {
    'menu': (107, 9, 162, 36),  # 业务区
    'choose-region': (107, 9, 162, 36),  # 任务->选择区域
    'task-info-window': (580, 126, 702, 153),  # 任务信息

    'task-info-notice': (734, 487, 800, 516),  # 任务信息->确认扫荡界面

    'scan-confirm': (605, 560, 675, 601),  # 任务信息->确认扫荡
    'scan-skip': (605, 493, 680, 525),  # 扫荡->跳过
    'buy-ap-window': (588, 150, 690, 183),  # 购买体力弹窗
    'buy-hard-count': (578, 250, 677, 277),  # 恢复困难挑战次数

    'task-info': (578, 124, 702, 153),  # 任务信息弹窗
    'fight-task': (107, 9, 162, 36),  # 战斗任务弹窗
    'force-edit': (107, 9, 162, 36),  # 部队编辑界面
    'fight-skip': (1111, 531, 1136, 556),  # 跳过战斗
    'auto-over': (1072, 589, 1094, 611),  # 回合自动结束
    'force-1': (118, 548, 130, 564),
    'force-2': (118, 548, 130, 564),
    'force-3': (118, 548, 130, 564),
    'force-4': (118, 548, 130, 564),
    'box': (202, 531, 241, 570),  # 钻石宝箱
    'get-box': (614, 500, 666, 525),  # 获取宝箱
    'task-scan': (916, 218, 957, 237),  # 是否可以扫荡
    'side-quest': (360, 215, 401, 234),  # 支线任务
    'attack': (1126, 642, 1191, 670),  # 编队界面右下角出击
    'prize-confirm': (742, 642, 803, 668),  # 获得奖励确认按钮(支线通关)
    'task-finish': (1000, 648, 1063, 678),  # 任务完成确认按钮(主线通关)
    'no-pass': (198, 354, 220, 376),  # 未通关
    'move-force-confirm': (732, 483, 800, 516),  # 移动部队确认按钮
    'end-turn': (732, 483, 800, 516),  # 结束回合确认按钮
    'fight-task-info': (580, 83, 638, 113),  # 战斗过程中的任务信息弹窗
    'fail-confirm': (643, 637, 671, 676),  # 战斗失败确认按钮
    'mission-operating-task-info': (1000, 671, 1019, 679),  # 任务执行过程中任务信息(左下蓝色)
    'mission-operating-task-info-notice': (579, 81, 702, 116),  # 任务执行过程中任务信息(弹窗)
    'mission-pause': (583, 139, 707, 177),  # 中断任务
    'task-begin-without-further-editing-notice': (695, 334, 758, 365),  # 任务开始前不再编辑部队的提示
    'task-operating-round-over-notice': (598, 332, 708, 365),  # 任务执行过程中回合结束的提示
    'task-operating-feature': (13, 7, 67, 40),  # 任务执行过程中的特征（左上）
    'edit-force': (107, 9, 162, 36),  # 部队编辑
    'sss': (204, 362, 212, 434)  # 三颗星⭐️⭐️⭐️
}
